# Ifc Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..Ifc Property
GroupTypeId Class See Also
---
IFC Parameters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId Ifc { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Ifc As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Ifc {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace